/* automatically generated by rust-bindgen 0.72.1 */

pub const AMDSMI_GPU_UUID_SIZE: u32 = 38;
pub const AMDSMI_LIB_VERSION_MAJOR: u32 = 26;
pub const AMDSMI_LIB_VERSION_MINOR: u32 = 2;
pub const AMDSMI_LIB_VERSION_RELEASE: u32 = 1;
pub const AMDSMI_MAX_FAN_SPEED: u32 = 255;
impl amdsmi_init_flags_t {
    #[doc = "```text\n!< Initialize all processors\n```"]
    pub const AMDSMI_INIT_ALL_PROCESSORS: amdsmi_init_flags_t = amdsmi_init_flags_t(4294967295);
    #[doc = "```text\n!< Initialize AMD CPUS\n```"]
    pub const AMDSMI_INIT_AMD_CPUS: amdsmi_init_flags_t = amdsmi_init_flags_t(1);
    #[doc = "```text\n!< Initialize AMD GPUS\n```"]
    pub const AMDSMI_INIT_AMD_GPUS: amdsmi_init_flags_t = amdsmi_init_flags_t(2);
    #[doc = "```text\n!< Initialize Non-AMD CPUS\n```"]
    pub const AMDSMI_INIT_NON_AMD_CPUS: amdsmi_init_flags_t = amdsmi_init_flags_t(4);
    #[doc = "```text\n!< Initialize Non-AMD GPUS\n```"]
    pub const AMDSMI_INIT_NON_AMD_GPUS: amdsmi_init_flags_t = amdsmi_init_flags_t(8);
    #[doc = "```text\n< Initialize AMD CPUS and GPUS\n(Default option)\n```"]
    pub const AMDSMI_INIT_AMD_APUS: amdsmi_init_flags_t = amdsmi_init_flags_t(3);
}
#[repr(transparent)]
#[doc = "```text\n @brief Initialization flags\n\n Initialization flags may be OR'd together and passed to ::amdsmi_init().\n\n @cond @tag{gpu_bm_linux} @tag{host} @tag{cpu_bm} @tag{guest_windows} @endcond\n```"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]

    #[doc = "```text\n!< Retimer 2-3 0.9V voltage regulator temperature\n```"]
    pub const AMDSMI_TEMPERATURE_TYPE_BASEBOARD_RETIMER_2_3_0V9_VR: amdsmi_temperature_type_t =
        amdsmi_temperature_type_t(217);
    #[doc = "```text\n!< Retimer 6-7 0.9V voltage regulator temperature\n```"]
    pub const AMDSMI_TEMPERATURE_TYPE_BASEBOARD_RETIMER_6_7_0V9_VR: amdsmi_temperature_type_t =
        amdsmi_temperature_type_t(218);
    #[doc = "```text\n!< OAM 0-1-2-3 3.3V voltage regulator temperature\n```"]
    pub const AMDSMI_TEMPERATURE_TYPE_BASEBOARD_OAM_0_1_2_3_3V3_VR: amdsmi_temperature_type_t =
        amdsmi_temperature_type_t(219);
    #[doc = "```text\n!< OAM 4-5-6-7 3.3V voltage regulator temperature\n```"]
    pub const AMDSMI_TEMPERATURE_TYPE_BASEBOARD_OAM_4_5_6_7_3V3_VR: amdsmi_temperature_type_t =
        amdsmi_temperature_type_t(220);
    #[doc = "```text\n!< IBC HSC temperature\n```"]
    pub const AMDSMI_TEMPERATURE_TYPE_BASEBOARD_IBC_HSC: amdsmi_temperature_type_t =
        amdsmi_temperature_type_t(221);
    #[doc = "```text\n!< IBC temperature\n```"]
    pub const AMDSMI_TEMPERATURE_TYPE_BASEBOARD_IBC: amdsmi_temperature_type_t =
        amdsmi_temperature_type_t(222);
    pub const AMDSMI_TEMPERATURE_TYPE_BASEBOARD_LAST: amdsmi_temperature_type_t =
        amdsmi_temperature_type_t(249);
    #[doc = "```text\n!< Maximum per GPU temperature type\n```"]
    pub const AMDSMI_TEMPERATURE_TYPE__MAX: amdsmi_temperature_type_t =
        amdsmi_temperature_type_t(249);
}
#[repr(transparent)]
#[doc = "```text\n @brief This enumeration is used to indicate from which part of the processor a\n temperature reading should be obtained.\n\n @cond @tag{gpu_bm_linux} @tag{host} @tag{guest_windows} @endcond\n```"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct amdsmi_temperature_type_t(pub ::std::os::raw::c_uint);
#[doc = "```text\n @brief ASIC Information\n\n @cond @tag{gpu_bm_linux} @tag{guest_windows} @tag{host} @endcond\n```"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_asic_info_t {
    pub market_name: [::std::os::raw::c_char; 256usize],
    #[doc = "```text\n!< Use 32 bit to be compatible with other platform.\n```"]
    pub vendor_id: u32,
    pub vendor_name: [::std::os::raw::c_char; 256usize],
    #[doc = "```text\n!< The subsystem vendor ID\n```"]
    pub subvendor_id: u32,
    #[doc = "```text\n!< The device ID of a GPU\n```"]
    pub device_id: u64,
    #[doc = "```text\n!< The revision ID of a GPU\n```"]
    pub rev_id: u32,
    pub asic_serial: [::std::os::raw::c_char; 256usize],
    #[doc = "```text\n!< 0xFFFFFFFF if not supported\n```"]
    pub oam_id: u32,
    #[doc = "```text\n!< 0xFFFFFFFF if not supported\n```"]
    pub num_of_compute_units: u32,
    #[doc = "```text\n!< 0xFFFFFFFFFFFFFFFF if not supported\n```"]
    pub target_graphics_version: u64,
    pub subsystem_id: u32,
    #[doc = "```text\n!> The subsystem ID\n```"]
    pub reserved: [u32; 21usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_asic_info_t"][::std::mem::size_of::<amdsmi_asic_info_t>() - 896usize];
    ["Alignment of amdsmi_asic_info_t"][::std::mem::align_of::<amdsmi_asic_info_t>() - 8usize];
    ["Offset of field: amdsmi_asic_info_t::market_name"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, market_name) - 0usize];
    ["Offset of field: amdsmi_asic_info_t::vendor_id"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, vendor_id) - 256usize];
    ["Offset of field: amdsmi_asic_info_t::vendor_name"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, vendor_name) - 260usize];
    ["Offset of field: amdsmi_asic_info_t::subvendor_id"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, subvendor_id) - 516usize];
    ["Offset of field: amdsmi_asic_info_t::device_id"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, device_id) - 520usize];
    ["Offset of field: amdsmi_asic_info_t::rev_id"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, rev_id) - 528usize];
    ["Offset of field: amdsmi_asic_info_t::asic_serial"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, asic_serial) - 532usize];
    ["Offset of field: amdsmi_asic_info_t::oam_id"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, oam_id) - 788usize];
    ["Offset of field: amdsmi_asic_info_t::num_of_compute_units"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, num_of_compute_units) - 792usize];
    ["Offset of field: amdsmi_asic_info_t::target_graphics_version"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, target_graphics_version) - 800usize];
    ["Offset of field: amdsmi_asic_info_t::subsystem_id"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, subsystem_id) - 808usize];
    ["Offset of field: amdsmi_asic_info_t::reserved"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, reserved) - 812usize];
};
#[doc = "```text\n @brief Power Information\n\n Unsupported struct members are set to UINT32_MAX\n\n @cond @tag{gpu_bm_linux} @endcond\n```"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_power_info_t {
    #[doc = "```text\n!< Socket power in W\n```"]
    pub socket_power: u64,
    #[doc = "```text\n!< Current socket power in W, Mi 300+ Series cards\n```"]
    pub current_socket_power: u32,
    #[doc = "```text\n!< Average socket power in W, Navi + Mi 200 and earlier Series cards\n```"]
    pub average_socket_power: u32,
    #[doc = "```text\n!< GFX voltage measurement in mV\n```"]
    pub gfx_voltage: u64,
    #[doc = "```text\n!< SOC voltage measurement in mV\n```"]
    pub soc_voltage: u64,
    #[doc = "```text\n!< MEM voltage measurement in mV\n```"]
    pub mem_voltage: u64,
    #[doc = "```text\n!< The power limit in W\n```"]
    pub power_limit: u32,
    pub reserved: [u64; 18usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_power_info_t"][::std::mem::size_of::<amdsmi_power_info_t>() - 192usize];
    ["Alignment of amdsmi_power_info_t"][::std::mem::align_of::<amdsmi_power_info_t>() - 8usize];
    ["Offset of field: amdsmi_power_info_t::socket_power"]
        [::std::mem::offset_of!(amdsmi_power_info_t, socket_power) - 0usize];
    ["Offset of field: amdsmi_power_info_t::current_socket_power"]
        [::std::mem::offset_of!(amdsmi_power_info_t, current_socket_power) - 8usize];
    ["Offset of field: amdsmi_power_info_t::average_socket_power"]
        [::std::mem::offset_of!(amdsmi_power_info_t, average_socket_power) - 12usize];
    ["Offset of field: amdsmi_power_info_t::gfx_voltage"]
        [::std::mem::offset_of!(amdsmi_power_info_t, gfx_voltage) - 16usize];
    ["Offset of field: amdsmi_power_info_t::soc_voltage"]
        [::std::mem::offset_of!(amdsmi_power_info_t, soc_voltage) - 24usize];
    ["Offset of field: amdsmi_power_info_t::mem_voltage"]
        [::std::mem::offset_of!(amdsmi_power_info_t, mem_voltage) - 32usize];
    ["Offset of field: amdsmi_power_info_t::power_limit"]
        [::std::mem::offset_of!(amdsmi_power_info_t, power_limit) - 40usize];
    ["Offset of field: amdsmi_power_info_t::reserved"]
        [::std::mem::offset_of!(amdsmi_power_info_t, reserved) - 48usize];
};
#[doc = "```text\n @brief Clock Information\n\n @cond @tag{gpu_bm_linux} @tag{guest_windows} @tag{host} @endcond\n```"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_clk_info_t {
    #[doc = "```text\n!< In MHz\n```"]
    pub clk: u32,
    #[doc = "```text\n!< In MHz\n```"]
    pub min_clk: u32,
    #[doc = "```text\n!< In MHz\n```"]
    pub max_clk: u32,
    #[doc = "```text\n!< True/False\n```"]
    pub clk_locked: u8,
    #[doc = "```text\n!< True/False\n```"]
    pub clk_deep_sleep: u8,
    pub reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_clk_info_t"][::std::mem::size_of::<amdsmi_clk_info_t>() - 32usize];
    ["Alignment of amdsmi_clk_info_t"][::std::mem::align_of::<amdsmi_clk_info_t>() - 4usize];
    ["Offset of field: amdsmi_clk_info_t::clk"]
        [::std::mem::offset_of!(amdsmi_clk_info_t, clk) - 0usize];
    ["Offset of field: amdsmi_clk_info_t::min_clk"]
        [::std::mem::offset_of!(amdsmi_clk_info_t, min_clk) - 4usize];
    ["Offset of field: amdsmi_clk_info_t::max_clk"]
        [::std::mem::offset_of!(amdsmi_clk_info_t, max_clk) - 8usize];
    ["Offset of field: amdsmi_clk_info_t::clk_locked"]
        [::std::mem::offset_of!(amdsmi_clk_info_t, clk_locked) - 12usize];
    ["Offset of field: amdsmi_clk_info_t::clk_deep_sleep"]
        [::std::mem::offset_of!(amdsmi_clk_info_t, clk_deep_sleep) - 13usize];
    ["Offset of field: amdsmi_clk_info_t::reserved"]
        [::std::mem::offset_of!(amdsmi_clk_info_t, reserved) - 16usize];
};
#[doc = "```text\n @brief Engine Usage\n amdsmi_engine_usage_t:\n This structure holds common\n GPU activity values seen in both BM or\n SRIOV\n\n @cond @tag{gpu_bm_linux} @tag{guest_windows} @tag{host} @endcond\n```"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_engine_usage_t {
    #[doc = "```text\n!< In %\n```"]
    pub gfx_activity: u32,
    #[doc = "```text\n!< In %\n```"]
    pub umc_activity: u32,
    #[doc = "```text\n!< In %\n```"]
    pub mm_activity: u32,
    pub reserved: [u32; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_engine_usage_t"][::std::mem::size_of::<amdsmi_engine_usage_t>() - 64usize];
    ["Alignment of amdsmi_engine_usage_t"]
        [::std::mem::align_of::<amdsmi_engine_usage_t>() - 4usize];
    ["Offset of field: amdsmi_engine_usage_t::gfx_activity"]
        [::std::mem::offset_of!(amdsmi_engine_usage_t, gfx_activity) - 0usize];
    ["Offset of field: amdsmi_engine_usage_t::umc_activity"]
        [::std::mem::offset_of!(amdsmi_engine_usage_t, umc_activity) - 4usize];
    ["Offset of field: amdsmi_engine_usage_t::mm_activity"]
        [::std::mem::offset_of!(amdsmi_engine_usage_t, mm_activity) - 8usize];
    ["Offset of field: amdsmi_engine_usage_t::reserved"]
        [::std::mem::offset_of!(amdsmi_engine_usage_t, reserved) - 12usize];
};
#[doc = "```text\n @brief Process Handle\n\n @cond @tag{gpu_bm_linux} @tag{guest_windows} @endcond\n```"]
pub type amdsmi_process_handle_t = u32;
#[doc = "```text\n @brief Process Information\n\n @cond @tag{gpu_bm_linux} @tag{guest_windows} @endcond\n```"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_proc_info_t {
    pub name: [::std::os::raw::c_char; 256usize],
    pub pid: amdsmi_process_handle_t,
    #[doc = "```text\n!< In Bytes\n```"]
    pub mem: u64,
    #[doc = "```text\n!< time the process spends using these engines in ns\n```"]
    pub engine_usage: amdsmi_proc_info_t_engine_usage_,
    #[doc = "```text\n!< In Bytes\n```"]
    pub memory_usage: amdsmi_proc_info_t_memory_usage_,
    pub container_name: [::std::os::raw::c_char; 256usize],
    #[doc = "```text\n!< Num CUs utilized\n```"]
    pub cu_occupancy: u32,
    #[doc = "```text\n!< Time that queues are evicted on a GPU in milliseconds\n```"]
    pub evicted_time: u32,
    pub reserved: [u32; 10usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_proc_info_t_engine_usage_ {
    #[doc = "```text\n!< In nano-secs\n```"]
    pub gfx: u64,
    #[doc = "```text\n!< In nano-secs\n```"]
    pub enc: u64,
    pub reserved: [u32; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_proc_info_t_engine_usage_"]
        [::std::mem::size_of::<amdsmi_proc_info_t_engine_usage_>() - 64usize];
    ["Alignment of amdsmi_proc_info_t_engine_usage_"]
        [::std::mem::align_of::<amdsmi_proc_info_t_engine_usage_>() - 8usize];
    ["Offset of field: amdsmi_proc_info_t_engine_usage_::gfx"]
        [::std::mem::offset_of!(amdsmi_proc_info_t_engine_usage_, gfx) - 0usize];
    ["Offset of field: amdsmi_proc_info_t_engine_usage_::enc"]
        [::std::mem::offset_of!(amdsmi_proc_info_t_engine_usage_, enc) - 8usize];
    ["Offset of field: amdsmi_proc_info_t_engine_usage_::reserved"]
        [::std::mem::offset_of!(amdsmi_proc_info_t_engine_usage_, reserved) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_proc_info_t_memory_usage_ {
    #[doc = "```text\n!< In Bytes\n```"]
    pub gtt_mem: u64,
    #[doc = "```text\n!< In Bytes\n```"]
    pub cpu_mem: u64,
    #[doc = "```text\n!< In Bytes\n```"]
    pub vram_mem: u64,
    pub reserved: [u32; 10usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_proc_info_t_memory_usage_"]
        [::std::mem::size_of::<amdsmi_proc_info_t_memory_usage_>() - 64usize];
    ["Alignment of amdsmi_proc_info_t_memory_usage_"]
        [::std::mem::align_of::<amdsmi_proc_info_t_memory_usage_>() - 8usize];
    ["Offset of field: amdsmi_proc_info_t_memory_usage_::gtt_mem"]
        [::std::mem::offset_of!(amdsmi_proc_info_t_memory_usage_, gtt_mem) - 0usize];
    ["Offset of field: amdsmi_proc_info_t_memory_usage_::cpu_mem"]
        [::std::mem::offset_of!(amdsmi_proc_info_t_memory_usage_, cpu_mem) - 8usize];
    ["Offset of field: amdsmi_proc_info_t_memory_usage_::vram_mem"]
        [::std::mem::offset_of!(amdsmi_proc_info_t_memory_usage_, vram_mem) - 16usize];
    ["Offset of field: amdsmi_proc_info_t_memory_usage_::reserved"]
        [::std::mem::offset_of!(amdsmi_proc_info_t_memory_usage_, reserved) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_proc_info_t"][::std::mem::size_of::<amdsmi_proc_info_t>() - 704usize];
    ["Alignment of amdsmi_proc_info_t"][::std::mem::align_of::<amdsmi_proc_info_t>() - 8usize];
    ["Offset of field: amdsmi_proc_info_t::name"]
        [::std::mem::offset_of!(amdsmi_proc_info_t, name) - 0usize];
    ["Offset of field: amdsmi_proc_info_t::pid"]
        [::std::mem::offset_of!(amdsmi_proc_info_t, pid) - 256usize];
    ["Offset of field: amdsmi_proc_info_t::mem"]
        [::std::mem::offset_of!(amdsmi_proc_info_t, mem) - 264usize];
    ["Offset of field: amdsmi_proc_info_t::engine_usage"]
        [::std::mem::offset_of!(amdsmi_proc_info_t, engine_usage) - 272usize];
    ["Offset of field: amdsmi_proc_info_t::memory_usage"]
        [::std::mem::offset_of!(amdsmi_proc_info_t, memory_usage) - 336usize];
    ["Offset of field: amdsmi_proc_info_t::container_name"]
        [::std::mem::offset_of!(amdsmi_proc_info_t, container_name) - 400usize];
    ["Offset of field: amdsmi_proc_info_t::cu_occupancy"]
        [::std::mem::offset_of!(amdsmi_proc_info_t, cu_occupancy) - 656usize];
    ["Offset of field: amdsmi_proc_info_t::evicted_time"]
        [::std::mem::offset_of!(amdsmi_proc_info_t, evicted_time) - 660usize];
    ["Offset of field: amdsmi_proc_info_t::reserved"]
        [::std::mem::offset_of!(amdsmi_proc_info_t, reserved) - 664usize];
};
impl amdsmi_temperature_metric_t {
    #[doc = "```text\n!< Current temperature\n```"]
    pub const AMDSMI_TEMP_CURRENT: amdsmi_temperature_metric_t = amdsmi_temperature_metric_t(0);
    pub const AMDSMI_TEMP_FIRST: amdsmi_temperature_metric_t = amdsmi_temperature_metric_t(0);
    #[doc = "```text\n!< Max temperature\n```"]
    pub const AMDSMI_TEMP_MAX: amdsmi_temperature_metric_t = amdsmi_temperature_metric_t(1);
    #[doc = "```text\n!< Min temperature\n```"]
    pub const AMDSMI_TEMP_MIN: amdsmi_temperature_metric_t = amdsmi_temperature_metric_t(2);
    #[doc = "```text\n< Max limit hysteresis temperature\n(Absolute temperature, not a delta)\n```"]
    pub const AMDSMI_TEMP_MAX_HYST: amdsmi_temperature_metric_t = amdsmi_temperature_metric_t(3);
    #[doc = "```text\n< Min limit hysteresis temperature\n(Absolute temperature, not a delta)\n```"]
